import random

# Создаем два списка по 5 элементов с приятными словами
adverbs = ["блистательно", "неотразимо", "восхитительно", "невероятно", "безупречно"]
adjectives = ["прекрасна!", "мила!", "красива!", "очаровательна!", "чудесна!"]


# Генератор комплиментов
def generate_compliment():
    # Выбираем случайное слово из первого и второго списка
    word1 = random.choice(adverbs)
    word2 = random.choice(adjectives)

    # Собираем и выводим фразу
    print(f"Ты {word1} {word2}")


# Пример работы программы (выведем 4 случайных комплимента)
for _ in range(4):
    generate_compliment()


# Генерируем числа от 10 до 5 с шагом -1
s = [x for x in range(10, 4, -1)]

print(s)


words = ["море", "солнце", "майка", "отпуск"]

# Фильтруем слова, которые оканчиваются на букву "е"
e_words = [i for i in words if i.endswith('е')]

print(e_words)